{
  "title": "Inside Out 2",
  "genre": "Animation/Family",
  "release_date": "June 14, 2024",
  "director": "Kelsey Mann",
  "writers": ["Meg LeFauve", "Pete Docter"],
  "producers": ["Jonas Rivera", "Mark Nielsen"],
  "production_companies": ["Pixar Animation Studios", "Walt Disney Pictures"],
  "voice_cast": ["Amy Poehler", "Phyllis Smith", "Bill Hader", "Mindy Kaling"],
  "new_emotions": ["Anxiety", "Embarrassment"],
  "runtime": "95 minutes",
  "budget": "$200 million",
  "box_office": "$1,698,863,816",
  "description": "In 'Inside Out 2,' Pixar takes audiences on an emotional journey deeper into Riley's mind as she navigates the complexities of adolescence. The sequel expands on the concept of emotions as characters, introducing new feelings like Anxiety and Embarrassment to reflect the challenges of teenage years. Set several years after the original film, Riley is now a teenager facing typical adolescent struggles such as social pressures, self-discovery, and evolving relationships with her family and friends. The narrative takes a creative turn as Riley's core emotions—Joy, Sadness, Anger, Disgust, and Fear—must adjust to the arrival of these new emotions, leading to conflicts and collaborations that test their dynamics. As Riley prepares for a school play, a series of mishaps in her mind's 'control center' cause her emotions to spiral into chaos, affecting her real-world confidence and behavior. The film explores themes of identity, emotional complexity, and the inevitability of change, all while maintaining a balance of humor, heart, and adventure. The movie also delves deeper into the mechanics of the mind, introducing new mindscapes such as the 'Hall of Awkward Moments,' the 'Island of Peer Pressure,' and an expanded 'Memory Vault' that stores Riley's evolving experiences. The vibrant visuals and innovative storytelling create a visually stunning and emotionally resonant experience that speaks to both children and adults. With its heartfelt moments, relatable struggles, and imaginative portrayal of the mind's inner workings, 'Inside Out 2' stands as a testament to Pixar's ability to craft stories that resonate across generations.",
  "themes": ["Emotional growth", "Family relationships", "Adolescence", "Self-discovery"],
  "rating": "PG",
  "IMDb": "8.4/10",
  "streaming_platforms": ["Disney+"],
  "release_formats": ["Theatrical", "IMAX", "3D", "Digital"],
  "image_url": "https://example.com/images/inside-out-2-poster.jpg"
}
